{
 "model": {
    "kind": "model",
    "name": "failover",
    "title": "Failover",
    "description": "Failover load balancer",
    "javaType": "org.apache.camel.model.loadbalancer.FailoverLoadBalancerDefinition",
    "label": "eip,routing,loadbalance",
    "deprecated": "false",
    "input": "false",
    "output": "false"
  },
  "properties": {
    "exception": { "kind": "element", "required": "false", "type": "array", "javaType": "java.util.List<java.lang.String>", "deprecated": "false", "secret": "false", "description": "A list of class names for specific exceptions to monitor. If no exceptions is configured then all exceptions is monitored" },
    "roundRobin": { "kind": "attribute", "required": "false", "type": "boolean", "javaType": "java.lang.Boolean", "deprecated": "false", "secret": "false", "defaultValue": "false", "description": "Whether or not the failover load balancer should operate in round robin mode or not. If not then it will always start from the first endpoint when a new message is to be processed. In other words it restart from the top for every message. If round robin is enabled then it keeps state and will continue with the next endpoint in a round robin fashion. You can also enable sticky mode together with round robin if so then it will pick the last known good endpoint to use when starting the load balancing (instead of using the next when starting)." },
    "sticky": { "kind": "attribute", "required": "false", "type": "boolean", "javaType": "java.lang.Boolean", "deprecated": "false", "secret": "false", "defaultValue": "false", "description": "Whether or not the failover load balancer should operate in sticky mode or not. If not then it will always start from the first endpoint when a new message is to be processed. In other words it restart from the top for every message. If sticky is enabled then it keeps state and will continue with the last known good endpoint. You can also enable sticky mode together with round robin if so then it will pick the last known good endpoint to use when starting the load balancing (instead of using the next when starting)." },
    "maximumFailoverAttempts": { "kind": "attribute", "required": "false", "type": "integer", "javaType": "java.lang.Integer", "deprecated": "false", "secret": "false", "defaultValue": "-1", "description": "A value to indicate after X failover attempts we should exhaust (give up). Use -1 to indicate never give up and continuously try to failover. Use 0 to never failover. And use e.g. 3 to failover at most 3 times before giving up. his option can be used whether or not roundRobin is enabled or not." },
    "id": { "kind": "attribute", "required": "false", "type": "string", "javaType": "java.lang.String", "deprecated": "false", "secret": "false", "description": "Sets the value of the id property." }
  }
}

